<x-layout>
    <x-slot:title>
        страница
    </x-slot>

<!-- 25.	Из действия в представление передается переменная $data. 
Эта переменная может содержать массив с числами либо быть обычным числом.
Если переменная $data - массив, то выведите элементы этого массива в виде списка ul, 
а если переменная $data - число, то выведите это число в абзаце.-->






    <h3>Результат оброботки массива</h3>
    
<ul>
    <p>четные элементы массива</p>
    @if
         
    @else

    @endif
</ul>
  

</x-loyaut>